#Задание №2.
#Петя очень умный школьник, и поэтому уверен, что оценки в жизни не главное! И,
#чтобы доказать это всем, он придумал план: заменить свои плохие оценки на хорошие. А
#чтобы было не очень заметно, Петя решил заменить двойки на трояки. Да вот одна проблема:
#оценок много, а времени мало. Помогите мальчику автоматизировать процесс.
#Обратите внимание, числа вводятся и выводятся в строку, при этом между элементами
#стоит пробел.
#Например,
#Input                  Output
#5 2 4 2 3             5 3 4 3 3 
